system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     chtMultiRegionSimpleFoam;

startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         15000;

deltaT          1;

writeControl    timeStep;
writeInterval   250;
purgeWrite      3;

writeFormat     ascii;
writePrecision  7;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

// ************************************************************************* //
functions
{
    // --- Conformal interfaces: wallHeatFlux still works perfectly ----------
    dieFlux
    {
        type            wallHeatFlux;
        libs            (fieldFunctionObjects);
        region          die;
        patches         (die_bottom die_to_ihs);
        writeControl    writeTime;
    }
    ihsFlux
    {
        type            wallHeatFlux;
        libs            (fieldFunctionObjects);
        region          ihs;
        patches         (ihs_to_die ihs_to_core);
        writeControl    writeTime;
    }

	coreFlux
    {
        type            wallHeatFlux;
        libs            (fieldFunctionObjects);
        region          core;
        patches         (core_to_ihs core_to_fins); 
        writeControl    writeTime;
    }

	finsFlux
    {
        type            wallHeatFlux;
        libs            (fieldFunctionObjects);
        region          fins;
        patches         (fins_to_core fins_to_fluid); 
        writeControl    writeTime;
    }

	fluidFlux
    {
        type            wallHeatFlux;
        libs            (fieldFunctionObjects);
        region          fluid;
        patches         (fluid_to_fins); 
        writeControl    writeTime;
    }

}