system/core/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| Core - butterfly mesh, split at y=4.3 (fin-root plane).                      |
|   y = 3.3 .. 4.3  (sub-fin band)   outer barrel -> core_to_fluid  (AMI->fluid)|
|   y = 4.3 .. 28.3 (fin height)     outer barrel -> core_to_fins   (AMI->fins) |
| bottom (y=3.3) core_to_ihs ; top (y=28.3) core_top. NOT snappy'd.            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 0.001;

vertices
(
    // ---- bottom plane  y = 3.3  (0..7) ----
    (5.656854 3.3 5.656854)        //  0
    (-5.656854 3.3 5.656854)        //  1
    (-5.656854 3.3 -5.656854)       //  2
    (5.656854 3.3 -5.656854)       //  3
    (12.37437 3.3 12.37437)     //  4
    (-12.37437 3.3 12.37437)     //  5
    (-12.37437 3.3 -12.37437)    //  6
    (12.37437 3.3 -12.37437)    //  7

    // ---- top plane  y = 28.3  (8..15) ----
    (5.656854 28.3 5.656854)       //  8
    (-5.656854 28.3 5.656854)       //  9
    (-5.656854 28.3 -5.656854)      // 10
    (5.656854 28.3 -5.656854)      // 11
    (12.37437 28.3 12.37437)    // 12
    (-12.37437 28.3 12.37437)    // 13
    (-12.37437 28.3 -12.37437)   // 14
    (12.37437 28.3 -12.37437)   // 15

    // ---- split plane  y = 4.3  (16..23, directly above 0..7) ----
    (5.656854 4.3 5.656854)        // 16
    (-5.656854 4.3 5.656854)        // 17
    (-5.656854 4.3 -5.656854)       // 18
    (5.656854 4.3 -5.656854)       // 19
    (12.37437 4.3 12.37437)     // 20
    (-12.37437 4.3 12.37437)     // 21
    (-12.37437 4.3 -12.37437)    // 22
    (12.37437 4.3 -12.37437)    // 23
);

blocks
(
    // ================= BAND  y = 3.3 -> 4.3  (Ny = 1) =================
    hex ( 0  3  2  1  16 19 18 17) (60 60 1) simpleGrading (1 1 1)  // diamond band
    hex ( 5  4  0  1  21 20 16 17) (60 14 1) simpleGrading (1 1 1)  // Q1 band
    hex ( 6  5  1  2  22 21 17 18) (60 14 1) simpleGrading (1 1 1)  // Q2 band
    hex ( 7  6  2  3  23 22 18 19) (60 14 1) simpleGrading (1 1 1)  // Q3 band
    hex ( 4  7  3  0  20 23 19 16) (60 14 1) simpleGrading (1 1 1)  // Q4 band

    // ================= FIN HEIGHT  y = 4.3 -> 28.3  (Ny = 8) =========
    hex (16 19 18 17  8 11 10  9) (60 60 8) simpleGrading (1 1 1)  // diamond top
    hex (21 20 16 17 13 12  8  9) (60 14 8) simpleGrading (1 1 1)  // Q1 top
    hex (22 21 17 18 14 13  9 10) (60 14 8) simpleGrading (1 1 1)  // Q2 top
    hex (23 22 18 19 15 14 10 11) (60 14 8) simpleGrading (1 1 1)  // Q3 top
    hex (20 23 19 16 12 15 11  8) (60 14 8) simpleGrading (1 1 1)  // Q4 top
);

edges
(
    // r = 17.5 arcs on all three planes
    arc  4  5 (0 3.3 17.5)
    arc  5  6 (-17.5 3.3 0)
    arc  6  7 (0 3.3 -17.5)
    arc  7  4 (17.5 3.3 0)

    arc 20 21 (0 4.3 17.5)
    arc 21 22 (-17.5 4.3 0)
    arc 22 23 (0 4.3 -17.5)
    arc 23 20 (17.5 4.3 0)

    arc 12 13 (0 28.3 17.5)
    arc 13 14 (-17.5 28.3 0)
    arc 14 15 (0 28.3 -17.5)
    arc 15 12 (17.5 28.3 0)
);

boundary
(
    core_to_ihs
    {
        type wall;
        faces ( (0 1 2 3) (5 1 0 4) (6 2 1 5) (7 3 2 6) (4 0 3 7) );
    }
    core_to_fluid          // sub-fin band barrel, y=3.3..4.3  -> AMI to fluid
    {
        type wall;
        faces ( (4 20 21 5) (5 21 22 6) (6 22 23 7) (7 23 20 4) );
    }
    core_to_fins           // fin-height barrel, y=4.3..28.3   -> AMI to fins
    {
        type wall;
        faces ( (20 12 13 21) (21 13 14 22) (22 14 15 23) (23 15 12 20) );
    }
    core_top
    {
        type wall;
        faces ( (8 11 10 9) (13 12 8 9) (14 13 9 10) (15 14 10 11) (12 15 11 8) );
    }
);

mergePatchPairs ( );
