system/die/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }

scale 0.001;

vertices
(
    (-5.2500 0.0000 7.7500)   // 0
    (5.2500 0.0000 7.7500)    // 1
    (5.2500 0.0000 -7.7500)   // 2
    (-5.2500 0.0000 -7.7500)  // 3
    (-5.2500 0.8000 7.7500)   // 4
    (5.2500 0.8000 7.7500)    // 5
    (5.2500 0.8000 -7.7500)   // 6
    (-5.2500 0.8000 -7.7500)  // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (35 52 8) simpleGrading (1 1 1)
);

edges ( );

boundary
(
    die_bottom        // y = 0.0
    { type wall; faces ( (0 3 2 1) ); }
    die_to_ihs        // y = 0.8
    { type wall; faces ( (4 5 6 7) ); }
    die_sides
    { type wall; faces ( (0 1 5 4) (2 3 7 6) (1 2 6 5) (3 0 4 7) ); }
);

mergePatchPairs ( );