system/fin_fluid/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | fin_fluid - butterfly centre above core, outer rings unchanged|
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 0.001;

vertices
(
    (12.37437 3.3 12.37437)                     // 0
    (-12.37437 3.3 12.37437)                     // 1
    (-12.37437 3.3 -12.37437)                    // 2
    (12.37437 3.3 -12.37437)                    // 3
    (35.35534 3.3 35.35534)                       // 4
    (-35.35534 3.3 35.35534)                       // 5
    (-35.35534 3.3 -35.35534)                      // 6
    (35.35534 3.3 -35.35534)                      // 7
    (45.96194 3.3 45.96194)                       // 8
    (-45.96194 3.3 45.96194)                       // 9
    (-45.96194 3.3 -45.96194)                      // 10
    (45.96194 3.3 -45.96194)                      // 11
    (5.656854 28.3 5.656854)                       // 12
    (-5.656854 28.3 5.656854)                       // 13
    (-5.656854 28.3 -5.656854)                      // 14
    (5.656854 28.3 -5.656854)                      // 15
    (12.37437 28.3 12.37437)                    // 16
    (-12.37437 28.3 12.37437)                    // 17
    (-12.37437 28.3 -12.37437)                   // 18
    (12.37437 28.3 -12.37437)                   // 19
    (35.35534 28.3 35.35534)                      // 20
    (-35.35534 28.3 35.35534)                      // 21
    (-35.35534 28.3 -35.35534)                     // 22
    (35.35534 28.3 -35.35534)                     // 23
    (45.96194 28.3 45.96194)                      // 24
    (-45.96194 28.3 45.96194)                      // 25
    (-45.96194 28.3 -45.96194)                     // 26
    (45.96194 28.3 -45.96194)                     // 27
    (5.656854 29.3 5.656854)                       // 28
    (-5.656854 29.3 5.656854)                       // 29
    (-5.656854 29.3 -5.656854)                      // 30
    (5.656854 29.3 -5.656854)                      // 31
    (12.37437 29.3 12.37437)                    // 32
    (-12.37437 29.3 12.37437)                    // 33
    (-12.37437 29.3 -12.37437)                   // 34
    (12.37437 29.3 -12.37437)                   // 35
    (35.35534 29.3 35.35534)                      // 36
    (-35.35534 29.3 35.35534)                      // 37
    (-35.35534 29.3 -35.35534)                     // 38
    (35.35534 29.3 -35.35534)                     // 39
    (45.96194 29.3 45.96194)                      // 40
    (-45.96194 29.3 45.96194)                      // 41
    (-45.96194 29.3 -45.96194)                     // 42
    (45.96194 29.3 -45.96194)                     // 43
    (5.656854 50.3 5.656854)                       // 44
    (-5.656854 50.3 5.656854)                       // 45
    (-5.656854 50.3 -5.656854)                      // 46
    (5.656854 50.3 -5.656854)                      // 47
    (12.37437 50.3 12.37437)                    // 48
    (-12.37437 50.3 12.37437)                    // 49
    (-12.37437 50.3 -12.37437)                   // 50
    (12.37437 50.3 -12.37437)                   // 51
    (35.35534 50.3 35.35534)                      // 52
    (-35.35534 50.3 35.35534)                      // 53
    (-35.35534 50.3 -35.35534)                     // 54
    (35.35534 50.3 -35.35534)                     // 55
);

blocks
(
    // lower mid Q1
    hex (5 4 0 1 21 20 16 17) (60 16 9) simpleGrading (1 1 1)
    // lower mid Q2
    hex (6 5 1 2 22 21 17 18) (60 16 9) simpleGrading (1 1 1)
    // lower mid Q3
    hex (7 6 2 3 23 22 18 19) (60 16 9) simpleGrading (1 1 1)
    // lower mid Q4
    hex (4 7 3 0 20 23 19 16) (60 16 9) simpleGrading (1 1 1)
    // lower outer Q1
    hex (9 8 4 5 25 24 20 21) (60 6 9) simpleGrading (1 1 1)
    // lower outer Q2
    hex (10 9 5 6 26 25 21 22) (60 6 9) simpleGrading (1 1 1)
    // lower outer Q3
    hex (11 10 6 7 27 26 22 23) (60 6 9) simpleGrading (1 1 1)
    // lower outer Q4
    hex (8 11 7 4 24 27 23 20) (60 6 9) simpleGrading (1 1 1)
    // gap diamond
    hex (12 15 14 13 28 31 30 29) (60 60 1) simpleGrading (1 1 1)
    // gap wing Q1
    hex (17 16 12 13 33 32 28 29) (60 14 1) simpleGrading (1 1 1)
    // gap wing Q2
    hex (18 17 13 14 34 33 29 30) (60 14 1) simpleGrading (1 1 1)
    // gap wing Q3
    hex (19 18 14 15 35 34 30 31) (60 14 1) simpleGrading (1 1 1)
    // gap wing Q4
    hex (16 19 15 12 32 35 31 28) (60 14 1) simpleGrading (1 1 1)
    // gap mid Q1
    hex (21 20 16 17 37 36 32 33) (60 16 1) simpleGrading (1 1 1)
    // gap mid Q2
    hex (22 21 17 18 38 37 33 34) (60 16 1) simpleGrading (1 1 1)
    // gap mid Q3
    hex (23 22 18 19 39 38 34 35) (60 16 1) simpleGrading (1 1 1)
    // gap mid Q4
    hex (20 23 19 16 36 39 35 32) (60 16 1) simpleGrading (1 1 1)
    // gap outer Q1
    hex (25 24 20 21 41 40 36 37) (60 6 1) simpleGrading (1 1 1)
    // gap outer Q2
    hex (26 25 21 22 42 41 37 38) (60 6 1) simpleGrading (1 1 1)
    // gap outer Q3
    hex (27 26 22 23 43 42 38 39) (60 6 1) simpleGrading (1 1 1)
    // gap outer Q4
    hex (24 27 23 20 40 43 39 36) (60 6 1) simpleGrading (1 1 1)
    // plenum diamond
    hex (28 31 30 29 44 47 46 45) (60 60 8) simpleGrading (1 1 1)
    // plenum wing Q1
    hex (33 32 28 29 49 48 44 45) (60 14 8) simpleGrading (1 1 1)
    // plenum wing Q2
    hex (34 33 29 30 50 49 45 46) (60 14 8) simpleGrading (1 1 1)
    // plenum wing Q3
    hex (35 34 30 31 51 50 46 47) (60 14 8) simpleGrading (1 1 1)
    // plenum wing Q4
    hex (32 35 31 28 48 51 47 44) (60 14 8) simpleGrading (1 1 1)
    // plenum mid Q1
    hex (37 36 32 33 53 52 48 49) (60 16 8) simpleGrading (1 1 1)
    // plenum mid Q2
    hex (38 37 33 34 54 53 49 50) (60 16 8) simpleGrading (1 1 1)
    // plenum mid Q3
    hex (39 38 34 35 55 54 50 51) (60 16 8) simpleGrading (1 1 1)
    // plenum mid Q4
    hex (36 39 35 32 52 55 51 48) (60 16 8) simpleGrading (1 1 1)
);

edges
(
    arc 0 1 (0 3.3 17.5)
    arc 1 2 (-17.5 3.3 0)
    arc 2 3 (0 3.3 -17.5)
    arc 3 0 (17.5 3.3 0)
    arc 4 5 (0 3.3 50)
    arc 5 6 (-50 3.3 0)
    arc 6 7 (0 3.3 -50)
    arc 7 4 (50 3.3 0)
    arc 8 9 (0 3.3 65)
    arc 9 10 (-65 3.3 0)
    arc 10 11 (0 3.3 -65)
    arc 11 8 (65 3.3 0)
    arc 16 17 (0 28.3 17.5)
    arc 17 18 (-17.5 28.3 0)
    arc 18 19 (0 28.3 -17.5)
    arc 19 16 (17.5 28.3 0)
    arc 20 21 (0 28.3 50)
    arc 21 22 (-50 28.3 0)
    arc 22 23 (0 28.3 -50)
    arc 23 20 (50 28.3 0)
    arc 24 25 (0 28.3 65)
    arc 25 26 (-65 28.3 0)
    arc 26 27 (0 28.3 -65)
    arc 27 24 (65 28.3 0)
    arc 32 33 (0 29.3 17.5)
    arc 33 34 (-17.5 29.3 0)
    arc 34 35 (0 29.3 -17.5)
    arc 35 32 (17.5 29.3 0)
    arc 36 37 (0 29.3 50)
    arc 37 38 (-50 29.3 0)
    arc 38 39 (0 29.3 -50)
    arc 39 36 (50 29.3 0)
    arc 40 41 (0 29.3 65)
    arc 41 42 (-65 29.3 0)
    arc 42 43 (0 29.3 -65)
    arc 43 40 (65 29.3 0)
    arc 48 49 (0 50.3 17.5)
    arc 49 50 (-17.5 50.3 0)
    arc 50 51 (0 50.3 -17.5)
    arc 51 48 (17.5 50.3 0)
    arc 52 53 (0 50.3 50)
    arc 53 54 (-50 50.3 0)
    arc 54 55 (0 50.3 -50)
    arc 55 52 (50 50.3 0)
);

boundary
(
    fins_to_core
    {
        type wall;
        faces
        (
            (0 16 17 1)
            (1 17 18 2)
            (2 18 19 3)
            (3 19 16 0)
        );
    }
    core_top
    {
        type wall;
        faces
        (
            (12 15 14 13)
            (17 16 12 13)
            (18 17 13 14)
            (19 18 14 15)
            (16 19 15 12)
        );
    }
    outerRim
    {
        type patch;
        faces
        (
            (8 24 25 9)
            (9 25 26 10)
            (10 26 27 11)
            (11 27 24 8)
            (24 40 41 25)
            (25 41 42 26)
            (26 42 43 27)
            (27 43 40 24)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 4 5 1)
            (1 5 6 2)
            (2 6 7 3)
            (3 7 4 0)
            (4 8 9 5)
            (5 9 10 6)
            (6 10 11 7)
            (7 11 8 4)
        );
    }
    shoulder
    {
        type wall;
        faces
        (
            (36 40 41 37)
            (37 41 42 38)
            (38 42 43 39)
            (39 43 40 36)
        );
    }
    plenum_wall
    {
        type wall;
        faces
        (
            (36 52 53 37)
            (37 53 54 38)
            (38 54 55 39)
            (39 55 52 36)
        );
    }
    plenum_top
    {
        type patch;
        faces
        (
            (44 47 46 45)
            (49 48 44 45)
            (50 49 45 46)
            (51 50 46 47)
            (48 51 47 44)
            (53 52 48 49)
            (54 53 49 50)
            (55 54 50 51)
            (52 55 51 48)
        );
    }
);

mergePatchPairs ( );
