system/ihs/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| IHS blockMesh - 3x3 columns in x-z. Center column (die footprint) = 35x52   |
| so its bottom face is node-conformal with die_top (die's 35x52 top).        |
| ihs_to_die = center block bottom only -> use nearestPatchFace (exact).      |
| ihs_to_core = full top (y=3.3) -> AMI against round core.                    |
\*---------------------------------------------------------------------------*/
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }

scale 0.001;

// x cuts: -22.5  -5.25  +5.25  +22.5   (die edges at +-5.25)
// z cuts: -18.75 -7.75  +7.75  +18.75  (die edges at +-7.75)
// y     : 0.8 (bottom, on die_top plane)  ->  3.3 (top, to core)

// divisions
// x:  side=31 , center=35 , side=31
// z:  side=20 , center=52 , side=20
// y:  10

vertices
(
    // ---- bottom plane  y = 0.8  (indices 0..15) ----
    (-22.50  0.8 -18.75)   //  0
    ( -5.25  0.8 -18.75)   //  1
    (  5.25  0.8 -18.75)   //  2
    ( 22.50  0.8 -18.75)   //  3
    (-22.50  0.8  -7.75)   //  4
    ( -5.25  0.8  -7.75)   //  5
    (  5.25  0.8  -7.75)   //  6
    ( 22.50  0.8  -7.75)   //  7
    (-22.50  0.8   7.75)   //  8
    ( -5.25  0.8   7.75)   //  9
    (  5.25  0.8   7.75)   // 10
    ( 22.50  0.8   7.75)   // 11
    (-22.50  0.8  18.75)   // 12
    ( -5.25  0.8  18.75)   // 13
    (  5.25  0.8  18.75)   // 14
    ( 22.50  0.8  18.75)   // 15

    // ---- top plane  y = 3.3  (indices 16..31, +16) ----
    (-22.50  3.3 -18.75)   // 16
    ( -5.25  3.3 -18.75)   // 17
    (  5.25  3.3 -18.75)   // 18
    ( 22.50  3.3 -18.75)   // 19
    (-22.50  3.3  -7.75)   // 20
    ( -5.25  3.3  -7.75)   // 21
    (  5.25  3.3  -7.75)   // 22
    ( 22.50  3.3  -7.75)   // 23
    (-22.50  3.3   7.75)   // 24
    ( -5.25  3.3   7.75)   // 25
    (  5.25  3.3   7.75)   // 26
    ( 22.50  3.3   7.75)   // 27
    (-22.50  3.3  18.75)   // 28
    ( -5.25  3.3  18.75)   // 29
    (  5.25  3.3  18.75)   // 30
    ( 22.50  3.3  18.75)   // 31
);

blocks
(
    // ---- z-row 0  (z: -18.75 -> -7.75), Nz = 20 ----
    hex ( 0  4  5  1  16 20 21 17) (20 31 10) simpleGrading (1 1 1)  // col0  Nx 31
    hex ( 1  5  6  2  17 21 22 18) (20 35 10) simpleGrading (1 1 1)  // col1  Nx 35
    hex ( 2  6  7  3  18 22 23 19) (20 31 10) simpleGrading (1 1 1)  // col2  Nx 31

    // ---- z-row 1  (z: -7.75 -> 7.75), Nz = 52  <-- die footprint row ----
    hex ( 4  8  9  5  20 24 25 21) (52 31 10) simpleGrading (1 1 1)  // col0
    hex ( 5  9 10  6  21 25 26 22) (52 35 10) simpleGrading (1 1 1)  // CENTER = die footprint 35(x) x 52(z)
    hex ( 6 10 11  7  22 26 27 23) (52 31 10) simpleGrading (1 1 1)  // col2

    // ---- z-row 2  (z: 7.75 -> 18.75), Nz = 20 ----
    hex ( 8 12 13  9  24 28 29 25) (20 31 10) simpleGrading (1 1 1)  // col0
    hex ( 9 13 14 10  25 29 30 26) (20 35 10) simpleGrading (1 1 1)  // col1
    hex (10 14 15 11  26 30 31 27) (20 31 10) simpleGrading (1 1 1)  // col2
);

edges ( );

boundary
(
    ihs_to_die
    {
        type wall;
        faces ( (5 6 10 9) );
    }

    ihs_bottom_rest
    {
        type wall;
        faces (
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
            (4 5 9 8)
            (6 7 11 10)
            (8 9 13 12)
            (9 10 14 13)
            (10 11 15 14)
        );
    }

    ihs_top_rest
    {
        type wall;
        faces (
            (16 20 21 17)
            (17 21 22 18)
            (18 22 23 19)
            (20 24 25 21)
            (21 25 26 22)
            (22 26 27 23)
            (24 28 29 25)
            (25 29 30 26)
            (26 30 31 27)
        );
    }

    ihs_sides
    {
        type wall;
        faces (
            // x = -22.5
            (0 4 20 16) (4 8 24 20) (8 12 28 24)
            // x = +22.5
            (3 19 23 7) (7 23 27 11) (11 27 31 15)
            // z = -18.75
            (0 16 17 1) (1 17 18 2) (2 18 19 3)
            // z = +18.75
            (12 13 29 28) (13 14 30 29) (14 15 31 30)
        );
    }
);

mergePatchPairs ( );
// ************************************************************************* //