system/ihs/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

patches
(
    {
        name ihs_to_core;
        patchInfo
        {
            type            mappedWall;
            inGroups        1(wall);
            sampleMode      nearestPatchFaceAMI;
            sampleRegion    core;
            samplePatch     core_to_ihs;
        }
        constructFrom set;
        set core_faces;
    }
);