0.orig/fins/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fins";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/constant/caseSettings"

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $TinitFins;

boundaryField
{
    fins_to_core
{
    type            compressible::turbulentTemperatureRadCoupledMixed;
    qrNbr           none;
    qr              none;
    Tnbr            T;
    kappaMethod     solidThermo;
    value           uniform $TinitFins;
    thicknessLayers ( $jointThickness );
    kappaLayers     ( $jointKappa );
}

    fins_to_fluid
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        qrNbr           none;
        qr              none;
        Tnbr            T;
        kappaMethod     solidThermo;
        value           uniform $TinitFins;
    }
}

// ************************************************************************* //
