system/core/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         cellLimited Gauss linear 1.0;
}

divSchemes
{
    default         none;       // pure conduction: no convective fluxes
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
	interpolation(k)	harmonic;
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
