system/fins/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes      { default Gauss linear; }

divSchemes
{
    default         none;
}

laplacianSchemes { default Gauss linear limited corrected 0.5; }


interpolationSchemes{ default         linear;}

snGradSchemes    { default limited corrected 0.5; }

// ************************************************************************* //
