system/fluid/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         cellLimited Gauss linear 1;
    grad(U)         cellLimited Gauss linear 1;
}

divSchemes
{
    default         none;

    div(phi,U)          bounded Gauss linearUpwind grad(U);

    div(phi,h)          bounded Gauss limitedLinear 1;
    div(phi,e)      bounded Gauss upwind;           // thermophysicalProperties is
                                                    // used; the other is ignored
    div(phi,K)          bounded Gauss linear;
    div(phi,Ekp)    bounded Gauss upwind;

    div(phi,k)      bounded Gauss upwind;
    div(phi,omega)  bounded Gauss upwind;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes { default Gauss linear limited corrected 0.5; }

snGradSchemes    { default limited corrected 0.5; }

interpolationSchemes { default linear; }

wallDist
{
    method          meshWave;       // required by kOmegaSST
}

// ************************************************************************* //
