system/fin_fluid/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// Required placeholder for multi-region cases: per-region files under
// system/<region>/ carry the real settings.

solvers
{
    // This regex matches every region (fluid, core, die, etc.) 
    // and forces the PBiCGStab solver for the 'h' field.
    "(.*)/h"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.0;
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors 3;
}

relaxationFactors
{
    equations
    {
        "(.*)/h"        0.3;
    }
}

// ************************************************************************* //
