system/fluid/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-9;
        relTol          0.1;
    }

    "(U|k|omega)"  { solver PBiCGStab; preconditioner DILU; tolerance 1e-7; relTol 0.1; }
	h              { solver PBiCGStab; preconditioner DILU; tolerance 1e-8; relTol 0;   }
}

SIMPLE
{
    momentumPredictor   yes;
    nNonOrthogonalCorrectors 2;        
    pRefCell            0;             // ignored: outerRim fixes p_rgh
    pRefValue           101325;
}

relaxationFactors
{
    fields
    {
        p_rgh           0.5;
        rho             0.3;
    }
    equations
    {
        U               0.5;           // conservative for the mesh quality;
        h              	0.99;           
        e               0.5;
        k               0.5;
        omega           0.5;
    }
}

// ************************************************************************* //
