system/surfaceFeatureExtractDict
FoamFile
{
    version 2.0; format ascii; class dictionary; object surfaceFeatureExtractDict;
}

Radial_Fins.stl
{
    extractionMethod    extractFromSurface;
    extractFromSurfaceCoeffs { includedAngle 150; }
    subsetFeatures      { nonManifoldEdges no; openEdges yes; }
    writeObj            yes;
}